{
  "it": {
    "header.title": "Cantina e Ristorante Tre Fratelli",
    "nav.storia": "Storia",
    "nav.vini": "Vini",
    "nav.visite": "Visite",
    "nav.contatto": "Contatto",
    "hero.h2": "🍷 Cantina e Ristorante Tre Fratelli",
    "hero.p": "Un ristorante e cantina di famiglia che celebra la tradizione enogastronomica della Valtellina, offrendo vini artigianali e piatti tipici preparati con ingredienti locali.",
    "historia.h2": "Nostra Storia",
    "historia.p1": "La Cantina e Ristorante Tre Fratelli vide la luce nel 1925, a Tirano, una piccola città della splendida Valtellina, in Lombardia.",
    "historia.p2": "Tutto ebbe inizio con Giovanni Ferraro, patriarca della famiglia, che ereditò un piccolo vigneto sulle colline di San Stefano. Insieme ai suoi tre figli — Marco, Paolo e Lorenzo — iniziò a coltivare uve nebbiolo (Chiavennasca) per creare un vino autenticamente artigianale.",
    "historia.h3_1": "🌿 Decenni di Sfide",
    "historia.p3": "<strong>Anni ’30:</strong> La crisi economica e l’instabilità politica misero in difficoltà la famiglia. Teresa, la madre, aprì una piccola cucina per i viaggiatori della ferrovia di Tirano, unendo vino e cucina locale.",
    "historia.p4": "<strong>Seconda Guerra Mondiale:</strong> La produzione fu quasi interrotta; molte botti vennero nascoste in grotte di pietra per proteggerle dai saccheggi.",
    "historia.p5": "<strong>Anni ’60–’70:</strong> Con l’arrivo del turismo alpino, i nipoti rinnovarono la struttura mantenendo viva la tradizione familiare.",
    "historia.p6": "<strong>Anni ’80:</strong> Un nuovo periodo di crisi economica mise a rischio l’attività, ma Alessandro, bisnipote di Giovanni, introdusse innovazioni grazie ai suoi studi di enologia a Milano.",
    "historia.h3_2": "🍇 Oggi",
    "historia.p7": "Nel 2025 la cantina celebra un secolo di storia. La quarta generazione della famiglia Ferraro continua a custodire la stessa passione per l’ospitalità, il vino e la buona tavola.",
    "vini.h2": "I Nostri Vini",
    "vino1.titolo": "Nebbiolo delle Alpi – Riserva Tre Fratelli",
    "vino1.p": "Un Nebbiolo di montagna dal carattere deciso e profondo, espressione autentica dei vigneti terrazzati della Valtellina.",
    "vino2.titolo": "Valtellina Rosso – Cuore di Tirano",
    "vino2.p": "Un vino elegante e armonioso, che racchiude l’essenza del territorio e accompagna perfettamente i piatti tipici locali.",
    "vino3.titolo": "Sforzato della Nonna Teresa",
    "vino3.p": "Dedicato a Teresa, la fondatrice della cucina di famiglia: uno sforzato intenso, profumato e ricco di tradizione.",
    "visite.h2": "Visitate la Nostra Cantina",
    "visite.p": "Scoprite la nostra storia, degustate i vini artigianali e ammirate i panorami delle Alpi e dei vigneti terrazzati che circondano Tirano.",
    "visite.bottone": "prenota una visita",
    "contatto.h2": "Contatto",
    "contatto.p": "per informazioni e prenotazioni: ",
    "contatto.email": "info@trefratelli.example",
    "contatto.telefono": "oppure chiama +39 0342 123456",
    "footer.addr": "📍 Via S. Stefano, 55 — 28087 Tirano (SO), Italia",
    "footer.desc": "Nel cuore della Valtellina, tra vigneti e montagne alpine.",
    "footer.copy": "© 2025 Cantina e Ristorante Tre Fratelli — Tutti i diritti riservati",
    "button.title": "Passa all'inglese",
    "button.imgAlt": "Tradurre / Translate",
    "button.label": "English"
  },
  "en": {
    "header.title": "Tre Fratelli Winery & Restaurant",
    "nav.storia": "History",
    "nav.vini": "Wines",
    "nav.visite": "Visits",
    "nav.contatto": "Contact",
    "hero.h2": "🍷 Tre Fratelli Winery & Restaurant",
    "hero.p": "A family-run restaurant and winery celebrating the enogastronomic tradition of Valtellina, offering handcrafted wines and local dishes prepared with regional ingredients.",
    "historia.h2": "Our History",
    "historia.p1": "Tre Fratelli Winery & Restaurant was established in 1925 in Tirano, a small town in the beautiful Valtellina, Lombardy.",
    "historia.p2": "It all began with Giovanni Ferraro, the family patriarch, who inherited a small vineyard on the hills of San Stefano. Together with his three sons — Marco, Paolo and Lorenzo — he began cultivating Nebbiolo (Chiavennasca) grapes to produce an authentic artisan wine.",
    "historia.h3_1": "🌿 Decades of Challenges",
    "historia.p3": "<strong>1930s:</strong> Economic crisis and political instability made life difficult for the family. Teresa, the matriarch, opened a small kitchen for travellers on the Tirano railway, combining wine and local cuisine.",
    "historia.p4": "<strong>Second World War:</strong> Production was nearly halted; many barrels were hidden in stone caves to protect them from looting.",
    "historia.p5": "<strong>1960s–70s:</strong> With the rise of alpine tourism, the grandchildren renovated the estate while keeping the family tradition alive.",
    "historia.p6": "<strong>1980s:</strong> A new economic crisis threatened the business, but Alessandro, Giovanni's great-grandson, introduced innovations thanks to his oenology studies in Milan.",
    "historia.h3_2": "🍇 Today",
    "historia.p7": "In 2025 the winery celebrates a century of history. The fourth generation of the Ferraro family continues to preserve the same passion for hospitality, wine and good food.",
    "vini.h2": "Our Wines",
    "vino1.titolo": "Nebbiolo of the Alps – Tre Fratelli Reserve",
    "vino1.p": "A mountain Nebbiolo with a bold, deep character — an authentic expression of Valtellina's terraced vineyards.",
    "vino2.titolo": "Valtellina Rosso – Heart of Tirano",
    "vino2.p": "An elegant, harmonious wine that captures the essence of the territory and pairs perfectly with local dishes.",
    "vino3.titolo": "Grandma Teresa's Sforzato",
    "vino3.p": "Dedicated to Teresa, the founder of the family kitchen: an intense, fragrant sforzato rich in tradition.",
    "visite.h2": "Visit Our Winery",
    "visite.p": "Discover our history, taste our handcrafted wines and admire the alpine landscapes and terraced vineyards around Tirano.",
    "visite.bottone": "book a visit",
    "contatto.h2": "Contact",
    "contatto.p": "for information and reservations: ",
    "contatto.email": "info@trefratelli.example",
    "contatto.telefono": "or call +39 0342 123456",
    "footer.addr": "📍 Via S. Stefano, 55 — 28087 Tirano (SO), Italy",
    "footer.desc": "In the heart of Valtellina, among vineyards and alpine mountains.",
    "footer.copy": "© 2025 Tre Fratelli Winery & Restaurant — All rights reserved",
    "button.title": "Switch to Italian",
    "button.imgAlt": "Translate / Tradurre",
    "button.label": "Italiano"
  }
}
